[
  {
    "chapter": 1,
    "title": "Enterprise Governance",
    "overview": [
      "This domain includes questions from the following topics:",
      "- Organizational culture",
      "- Types of legal and regulatory requirements",
      "- Organization structure, roles, and responsibilities",
      "- Ethics and codes of conduct",
      "This chapter covers Certified Information Security Manager (CISM) job practice 1, \"Information Security Governance, \" part A, \"Enterprise Governance\". The entire Information Security Governance domain represents 17 percent of the CISM examination.",
      "Supporting Tasks in the CISM job practice that align with the Information Security Governance / Enterprise Governance domain include",
      "4. Integrate information security governance into corporate governance.",
      "8. Define, communicate, and monitor information security responsibilities throughout the organization and lines of authority.",
      "21. Identify legal, regulatory, organizational, and other applicable compliance requirements.",
      "When properly implemented, security governance is the foundation that supports security-related strategic decisions and all other security activities. Governance is a process whereby senior management exerts strategic control over business functions through policies, objectives, delegation of authority, and monitoring. Governance is management's oversight of all other business processes to ensure that business processes effectively meet the organization's business vision and objectives.",
      "Organizations usually establish governance through steering committees responsible for setting long-term business strategy and making changes to ensure that business processes continue to support business strategy and the organization's overall needs. This is accomplished through the development and enforcement of documented policies, standards, procedures, and requirements. Various reporting metrics provide feedback to business leaders on organizational performance and the results of their decisions."
    ],
    "start_question": 1
  },
  {
    "chapter": 2,
    "title": "Information Security Strategy",
    "overview": [
      "This domain includes questions from the following topics:",
      "- Business alignment",
      "- Security strategy development",
      "- Security governance activities",
      "- Information security strategy development",
      "- Resources needed to develop and execute a security strategy",
      "- Obstacles to strategy development and execution",
      "This chapter covers Certified Information Security Manager (CISM) job practice 1, \"Information Security Governance, \" part B, \"Information Security Strategy.\" The entire Information Security Governance domain represents 17 percent of the CISM examination.",
      "Supporting Tasks in the CISM job practice that align with the Information Security Governance / Information Security Strategy domain include",
      "1. identify internal and external drivers that impact the information security strategy.",
      "2. Establish and/or maintain an information security strategy in alignment with organizational goals and objectives.",
      "3. Establish and/or maintain an information security governance framework.",
      "6. Develop business cases to support investments in formation security.",
      "7. Gain ongoing commitment from senior leadership and other stakeholders to support the successful implementation of the information security strategy.",
      "If for no other reason than cyber threats are ever-changing and increasingly dangerous, all organizations need to reassess their information security programs and develop strategies for key improvements.",
      "A strategy is a plan to achieve a defined set of objectives to enable the vision of the organization to be successfully achieved. Objectives are the desired future states in an organization and, in the context of information security, in the organization’s information security program. A strategy should be business aligned, and it should deliver value, optimize resources, and be measurable.",
      "Security managers can build a security program around a security governance standard framework (not to be confused with control frameworks) such as NIST CSF or ISO/IEC 27001.",
      "Often it is necessary to build a business case so that executive management will agree to support and fund a strategy. A business case typically includes a problem statement, followed by a description of the current state, the desired future state, requirements, an approach, and a plan to achieve the strategy. Often a business case is reviewed by a business or IT steering committee consisting of business stakeholders"
    ],
    "start_question": 26
  },
  {
    "chapter": 3,
    "title": "Information Security Risk Assessment",
    "overview": [
      "This domain includes questions from the following topics:",
      "- Benefits and outcomes of an information risk management program",
      "- Developing a risk management strategy",
      "- Risk assessment and risk management standards and frameworks",
      "- The risk management life-cycle process",
      "- Vulnerability and threat analysis",
      "- Integrating risk management into an organization's practices and culture",
      "- The components of a risk assessment: asset value, vulnerabilities, threats, and probability and impact of occurrence",
      "- Qualitative and quantitative risk analysis",
      "- The risk register",
      "- Risk management in other business processes",
      "This chapter covers Certified Information Security Manager (CISM) Domain 2, \"Information Security Risk Management, \" part A, \"Information Security Risk Assessment. \" The entire Information Security Risk Management domain represents 20 percent of the CISM examination.",
      "Supporting Tasks in the CISM job practice that align with the Information Security Risk Management / Information Security Risk Assessment domain include",
      "22. Participate in and/or oversee the risk identification, risk assessment, and risk treatment process.",
      "23. Participate in and/or oversee the vulnerability assessment and threat analysis process.",
      "26. Facilitate the integration of information risk management into business and IT processes.",
      "Information security risk management is the practice of balancing business opportunities with potential information security-related losses or negative impacts to business operations. Information security risk management is largely a qualitative effort, because it is difficult to know the probability and costs of significant loss events. Still, several methods for measuring risk have been established that help organizations better understand risks and how they can be handled. These methods include qualitative and quantitative techniques used to contribute to business decisions."
    ],
    "start_question": 52
  },
  {
    "chapter": 4,
    "title": "Information Security Risk Management",
    "overview": [
      "This domain includes questions from the following topics:",
      "- Risk response options and considerations",
      "- Responding to risk via risk treatment",
      "- Ownership of risks, risk treatment, and controls",
      "- Monitoring and reporting on risk",
      "- Key risk indicators",
      "This chapter covers Certified Information Security Manager (CISM) Domain 2, \"Information Security Risk Management, \" part B, \"Information Security Risk Response. \" The entire Information Security Risk Management domain represents 20 percent of the CISM examination.",
      "Supporting Tasks in the CISM job practice that align with the Information Security Risk Management / Information Security Risk Assessment domain include",
      "9. Compile and present reports to key stakeholders on the activities, trends, and overall effectiveness of the information security program.",
      "22. Participate in and/or oversee the risk identification, risk assessment, and risk treatment process.",
      "24. Identify, recommend, or implement appropriate risk treatment and response options to manage risk to acceptable levels based on organizational risk appetite.",
      "25. Determine whether information security controls are appropriate and effectively manage risk to an acceptable level.",
      "27. Monitor for internal and external factors that may require reassessment of risk.",
      "28. Report on information security risk, including noncompliance and changes in information risk, to key stakeholders to facilitate the risk management decision-making process.",
      "Information security risk response is the entirety of actions undertaken once the organization becomes aware of a risk. The risk management life cycle specifies that when a risk is identified, it is first analyzed. Next, a business decision, known as risk treatment, determines what the organization will do about an identified risk. Each risk is assigned an owner who participates in risk treatment decisions. If a control must be created or modified to mitigate the risk, management assigns an owner to the control itself. Finally, each risk is monitored and reports are created to track any changes in risk over time."
    ],
    "start_question": 82
  },
  {
    "chapter": 5,
    "title": "Information Security Program Development",
    "overview": [
      "This domain includes questions from the following topics:",
      "- Resources and outcomes related to information security programs",
      "- Asset, system, data, facilities, and personnel classification",
      "- Control and security management framework development",
      "- Policies, standards, guidelines, procedures, and requirements",
      "- Metrics that tell the security management and operations story",
      "This chapter covers Certified Information Security Manager (CISM) domain 3, \"Information Security Program, \" part A, \"Information Security Program Development. \" The entire Information Security Program domain represents 33 percent of the CISM examination.",
      "Supporting Tasks in the CISM job practice that align with the Information Security Program / Information Security Program Development domain include:",
      "5. Establish and maintain information security policies to guide the development of standards, procedures, and guidelines.",
      "10. Evaluate and report information security metrics to key stakeholders.",
      "11. Establish and/or maintain the information security program in alignment with the information security strategy.",
      "12. Align the information security program with the operational objectives of other business functions.",
      "13. Establish and maintain information security processes and resources to execute the information security program.",
      "14. Establish, communicate, and maintain organizational information security policies, standards, guidelines, procedures, and other documentation.",
      "20. Establish and/or maintain a process for information asset identification and classification.",
      "Establishing and modernizing an organization's cybersecurity program is one of the most important and impactful activities with long-term benefits (and consequences) a security leader will undertake. Cybersecurity program improvements are implemented as a result of a strategic plan. Cybersecurity program development consists of creating policy, controls, standards, requirements, guidelines, and a formal structure for security functions. Security leaders can choose from one of several frameworks that describe the structure of a security program. Security leaders use metrics to measure events and activities, enabling senior management to see the results of their directives."
    ],
    "start_question": 112
  },
  {
    "chapter": 6,
    "title": "Information Security Program Management",
    "overview": [
      "This domain includes questions from the following topics:",
      "- Controls and control design",
      "- Managing controls throughout their life cycle",
      "- Assessing controls to determine effectiveness",
      "- Reducing risk by conducting security awareness training",
      "- Identifying and managing third-party service providers",
      "- Communicating and reporting the state of the security program",
      "This chapter covers Certified Information Security Manager (CISM) Domain 3, \"Information Security Program, \" part B, \"Information Security Program Management. \" The entire Information Security Program domain represents 33 percent of the CISM examination.",
      "Supporting Tasks in the CISM job practice that align with the Information Security Program / Information Security Program Development domain include:",
      "15. Establish, promote, and maintain a program for information security awareness and training.",
      "16. Integrate information security requirements into organizational processes to maintain the organization's security strategy.",
      "17. Integrate information security requirements into contracts and activities of external parties.",
      "18. Monitor external parties' adherence to established security requirements.",
      "19. Define and monitor management and operational metrics for the information security program.",
      "Information security program management includes several types of activities intended to ensure that organizational objectives are met. These activities include resource management (staff, professional services, budget, and equipment), decision-making at every level, and coordination of activities through projects, tasks, and routine operations. In this domain, information security program management includes the design, selection, implementation, and testing of controls, as well as security awareness training, third-party risk management, and security program communications and reporting."
    ],
    "start_question": 161
  },
  {
    "chapter": 7,
    "title": "Incident Management Readiness",
    "overview": [
      "This domain includes questions from the following topics:",
      "- Similarities and differences between security incident response, business continuity planning, and disaster recovery planning",
      "- Performing a business impact analysis and criticality analysis",
      "- Developing business continuity and disaster recovery plans",
      "- Classifying incidents",
      "- Testing response plans and training personnel",
      "This chapter covers Certified Information Security Manager (CISM) Domain 4, \"Incident Management, \" part A, \"Incident Management Readiness. \" The entire Incident Management domain represents 30 percent of the CISM examination.",
      "Supporting Tasks in the CISM job practice that align with the Incident Management / Incident Management Readiness domain include:",
      "29. Establish and maintain an incident response plan, in alignment with the business continuity plan and disaster recovery plan.",
      "30. Establish and maintain an information security incident classification and categorization process.",
      "31. Develop and implement processes to ensure the timely identification of information security incidents.",
      "32. Establish and maintain processes to investigate and document information security incidents in accordance with legal and regulatory requirements.",
      "33. Establish and maintain incident handling process, including containment, notification, escalation, eradication, and recovery.",
      "34. Organize, train, equip, and assign responsibilities to incident response teams.",
      "35. Establish and maintain incident communication plans and processes for internal and external parties.",
      "36. Evaluate incident management plans through testing and review, including table-top exercises, checklist review, and simulation testing at planned intervals.",
      "Our world is full of surprises, including events that disrupt our plans and activities. In the context of IT and business, several unexpected events can cause significant disruption to business operations, even to the point of threatening the ongoing viability of the organization itself. These events include",
      "- Natural disasters",
      "- Human-made disasters",
      "- Malicious acts",
      "- Cyberattacks",
      "- Changes with unintended consequences",
      "Organizations cannot, for the most part, specifically anticipate these events. Any of these events may inflict damage on information systems, office equipment, and work centers, making it necessary for the organization to act quickly to continue business operations using alternative means. In the case of a cyberattack, it may or may not be possible to reverse the effects of the attack, eradicate whatever harm was caused to information systems, and continue operations on those systems. But in some cases, it may be necessary for the organization to continue information processing on other systems until the primary systems can be expunged of their attacker and the damage that has been inflicted.",
      "Incident management readiness begins with up-front analyses of business processes and their dependence upon business assets, including information systems. This analysis includes a big-picture prioritization of business processes and an up-close examination of business processes and information systems. This is followed by the development of contingency plans, response plans, and restoration plans. A natural by-product of all of this effort is improved resilience of business processes and information systems-even if disruptive events never occur-because overall weaknesses in processes and systems are identified, leading to steps to make tactical improvements."
    ],
    "start_question": 211
  },
  {
    "chapter": 8,
    "title": "Incident Management Operations",
    "overview": [
      "This domain includes questions from the following topics:",
      "- The steps involved in security incident response",
      "- Incident response tools and techniques",
      "- Attorney-client privilege",
      "- Crisis management and communications",
      "- Post-incident review and reporting",
      "This chapter covers Certified Information Security Manager (CISM) Domain 4, \"Incident Management, \" part B, \"Incident Management Operations. \" The entire Incident Management domain represents 30 percent of the CISM examination.",
      "One Supporting Task in the CISM job practice aligns with the Incident Management / Incident Management Operations domain:",
      "37. Conduct post-incident reviews to facilitate continuous improvement, including root-cause analysis, lessons learned, corrective actions, and reassessment of risk.",
      "Security incidents cannot be prevented-at least not all of them. In this asymmetric cyber war, attackers have innovation, time, and the element of surprise on their side. It is imperative that every organization using technology needs to develop formal security incident response plans, train their personnel, and continually practice with walk-throughs, drills, and simulations."
    ],
    "start_question": 256
  }
]